benchmarks/v_0503_b.txt
/usr/bin/java  -classpath /mnt/sdb/YCSB/conf:/mnt/sdb/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/animal-sniffer-annotations-1.19.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/annotations-4.1.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/checker-compat-qual-2.5.5.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/error_prone_annotations-2.4.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/failureaccess-1.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-api-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-context-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-core-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-netty-shaded-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-lite-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-stub-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/gson-2.8.6.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/guava-30.0-android.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/j2objc-annotations-1.3.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/javax.annotation-api-1.3.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jsr305-3.0.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/perfmark-api-0.23.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/proto-google-common-protos-2.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/protobuf-java-3.12.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.rocksdb.RocksDBClient -s -P workloads/workloadb -p rocksdb.dir=/users/root/test -threads 16 -replicator_addr 128.110.153.185:50050 -replicator_batch_size 100
Set replicator_addr to 128.110.153.185:50050
Set replicator batch size to 100
communicating with replicator at 128.110.153.185:50050
recvCount: 187500 met target
returned from latch for thread 70
recvCount: 187500 met target
returned from latch for thread 57
recvCount: 187500 met target
returned from latch for thread 67
recvCount: 187500 met target
returned from latch for thread 38
recvCount: 187500 met target
returned from latch for thread 46
recvCount: 187500 met target
returned from latch for thread 23
recvCount: 187500 met target
returned from latch for thread 50
recvCount: 187500 met target
returned from latch for thread 69
recvCount: 187500 met target
returned from latch for thread 30
recvCount: 187500 met target
returned from latch for thread 56
recvCount: 187500 met target
returned from latch for thread 27
recvCount: 187500 met target
returned from latch for thread 33
recvCount: 187500 met target
returned from latch for thread 58
recvCount: 187500 met target
returned from latch for thread 54
recvCount: 187500 met target
returned from latch for thread 41
recvCount: 187500 met target
returned from latch for thread 68
[OVERALL], RunTime(ms), 51939
[OVERALL], Throughput(ops/sec), 57760.064691272455
[TOTAL_GCS_G1_Young_Generation], Count, 31
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 721
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.388166888080248
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 31
[TOTAL_GC_TIME], Time(ms), 721
[TOTAL_GC_TIME_%], Time(%), 1.388166888080248
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 229.375
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 3573
[CLEANUP], 95thPercentileLatency(us), 13
[CLEANUP], 99thPercentileLatency(us), 3573
[INSERT], Operations, 3000000
[INSERT], AverageLatency(us), 234.77524466666668
[INSERT], MinLatency(us), 2
[INSERT], MaxLatency(us), 42696703
[INSERT], 95thPercentileLatency(us), 13
[INSERT], 99thPercentileLatency(us), 176
[INSERT], Return=OK, 3000000
/usr/bin/java  -classpath /mnt/sdb/YCSB/conf:/mnt/sdb/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/animal-sniffer-annotations-1.19.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/annotations-4.1.1.4.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/checker-compat-qual-2.5.5.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/error_prone_annotations-2.4.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/failureaccess-1.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-api-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-context-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-core-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-netty-shaded-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-protobuf-lite-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/grpc-stub-1.36.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/gson-2.8.6.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/guava-30.0-android.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/j2objc-annotations-1.3.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/javax.annotation-api-1.3.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/jsr305-3.0.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/listenablefuture-9999.0-empty-to-avoid-conflict-with-guava.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/perfmark-api-0.23.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/proto-google-common-protos-2.0.1.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/protobuf-java-3.12.0.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/mnt/sdb/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -s -P workloads/workloadb -p rocksdb.dir=/users/root/test -threads 16 -replicator_addr 128.110.153.185:50050 -replicator_batch_size 100
Set replicator_addr to 128.110.153.185:50050
Set replicator batch size to 100
communicating with replicator at 128.110.153.185:50050
recvCount: 62500 met target
returned from latch for thread 27
recvCount: 62500 met target
returned from latch for thread 58
recvCount: 62500 met target
returned from latch for thread 69
recvCount: 62500 met target
returned from latch for thread 70
recvCount: 62500 met target
returned from latch for thread 67
recvCount: 62500 met target
returned from latch for thread 44
recvCount: 62500 met target
returned from latch for thread 37
recvCount: 62500 met target
returned from latch for thread 34
recvCount: 62500 met target
returned from latch for thread 59
recvCount: 62500 met target
returned from latch for thread 41
recvCount: 62500 met target
returned from latch for thread 50
recvCount: 62500 met target
returned from latch for thread 56
recvCount: 62500 met target
returned from latch for thread 57
recvCount: 62500 met target
returned from latch for thread 23
recvCount: 62500 met target
returned from latch for thread 54
recvCount: 62500 met target
returned from latch for thread 30
[OVERALL], RunTime(ms), 9672
[OVERALL], Throughput(ops/sec), 103391.23242349048
[TOTAL_GCS_G1_Young_Generation], Count, 13
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 237
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.4503722084367245
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 13
[TOTAL_GC_TIME], Time(ms), 237
[TOTAL_GC_TIME_%], Time(%), 2.4503722084367245
[READ], Operations, 949913
[READ], AverageLatency(us), 90.06491226038595
[READ], MinLatency(us), 0
[READ], MaxLatency(us), 8708095
[READ], 95thPercentileLatency(us), 0
[READ], 99thPercentileLatency(us), 7
[READ], Return=OK, 949913
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 247.5625
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 3857
[CLEANUP], 95thPercentileLatency(us), 16
[CLEANUP], 99thPercentileLatency(us), 3857
[UPDATE], Operations, 50087
[UPDATE], AverageLatency(us), 24.836185038033822
[UPDATE], MinLatency(us), 0
[UPDATE], MaxLatency(us), 55231
[UPDATE], 95thPercentileLatency(us), 11
[UPDATE], 99thPercentileLatency(us), 58
[UPDATE], Return=OK, 50087